In [2]:
import numpy as np
import pandas as pd

In [27]:
data = pd.DataFrame({'food':['Apple','banana','orange','apple','Mango','tomato'],
                     'price':[4,3,3.5,6,12,3]})
data

     food  price
0   Apple    4.0
1  banana    3.0
2  orange    3.5
3   apple    6.0
4   Mango   12.0
5  tomato    3.0

In [42]:
meat = {
    'apple':'fruit',
    'banana':'fruit',
    'orange':'fruit',
    'mango':'fruit',
    'tomato':'vagetables'
}

In [45]:
#值小写
low = data['food'].str.lower()
low

0     apple
1    banana
2    orange
3     apple
4     mango
5    tomato
Name: food, dtype: object

In [48]:
data['class'] = data['food'].str.lower().map(meat)
data

     food  price       class      class1
0   Apple    4.0       fruit       fruit
1  banana    3.0       fruit       fruit
2  orange    3.5       fruit       fruit
3   apple    6.0       fruit       fruit
4   Mango   12.0       fruit       fruit
5  tomato    3.0  vagetables  vagetables

In [46]:
#函数
data['class1'] = data['food'].map(lambda x:meat[x.lower()])
data

     food  price       class      class1
0   Apple    4.0       fruit       fruit
1  banana    3.0       fruit       fruit
2  orange    3.5       fruit       fruit
3   apple    6.0       fruit       fruit
4   Mango   12.0       fruit       fruit
5  tomato    3.0  vagetables  vagetables